lefty01/ESP32_TTGO_FTMS/src/Hardware.cpp
/**
 *
 *
 * The MIT License (MIT)
 * Copyright © 2022 <Andreas Loeffler> <Zingo Andersen>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of this software
 * and associated documentation files (the “Software”), to deal in the Software without
 * restriction, including without limitation the rights to use, copy, modify, merge, publish,
 * distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all copies or
 * substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING
 * BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
 * NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
 * DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

#include <Arduino.h>
#include <Button2.h>
//#ifndef NO_MPU6050
#include <Wire.h>
#include <MPU6050_light.h> // accelerometer and gyroscope -> measure incline
//#endif
//#ifndef NO_VL53L0X
#include <VL53L0X.h>       // time-of-flight sensor -> get incline % from distance to ground
//#endif


#include "ESP32_TTGO_FTMS.h"
#include "net-control.h"
#include "hardware.h"
#include "debug_print.h"
#include "config.h"



esp_reset_reason_t reset_reason;
unsigned long sw_timer_clock = 0;



unsigned long wifi_reconnect_counter = 0;

//#define SPEED_IR_SENSOR1   15
//#define SPEED_IR_SENSOR2   13

bool timer_tick;
static constexpr int AW9523_INTERRUPT_PIN  = 25; // GPIO Extender interrupt
static constexpr int SPEED_REED_SWITCH_PIN = 26; // REED-Contact

float rpm = 0;
volatile unsigned long t1;
volatile unsigned long t2;
volatile bool t1_valid = false;
volatile bool t2_valid = false;

volatile unsigned long startTime = 0;     // start of revolution in microseconds
volatile unsigned long longpauseTime = 0; // revolution time with no reed-switch interrupt
volatile long accumulatorInterval = 0;    // time sum between display during intervals
volatile unsigned int revCount = 0;       // number of revolutions since last display update
volatile long accumulator4 = 0;           // sum of last 4 rpm times over 4 seconds
volatile long workoutDistance = 0; // FIXME: vs. total_dist ... select either reed/ir/manual

//csstatic TwoWire I2C_0 = TwoWire(0);
TwoWire I2C_0 = TwoWire(0);

// PINS
// NOTE TTGO T-DISPAY GPIO 36,37,38,39 can only be input pins https://github.com/Xinyuan-LilyGO/TTGO-T-Display/issues/10

// ttgo tft: 33, 25, 26, 27
// the number of the pushbutton pins

#if TARGET_TTGO_T_DISPLAY
// TTGO T-Display buttons
#define BUTTON_1 35
#define BUTTON_2  0
#elif TARGET_WT32_SC01
// This is a touch screen so there is no buttons
// IO_21 and IO_22 are routed out and use used for SPI to the screen
// Pins with names that start with J seems to be connected so screen, take care to avoid.
#ifndef NUM_TOUCH_BUTTONS
#define NUM_TOUCH_BUTTONS 6
#endif
//LGFX_Button touchButtons[NUM_TOUCH_BUTTONS];
LGFX_Button btnSpeedToggle    = LGFX_Button();
LGFX_Button btnInclineToggle  = LGFX_Button();
LGFX_Button btnSpeedUp        = LGFX_Button();
LGFX_Button btnSpeedDown      = LGFX_Button();
LGFX_Button btnInclineUp      = LGFX_Button();
LGFX_Button btnInclineDown    = LGFX_Button();
// 480 x 320, use full-top-half to show speed, incline, total_dist, and acc. elevation gain
// maybe draw some nice gauges for speed/incline and odometers for dist and elevation
// in addition might want to have an elevation profile being displayed
// 260, 5, 100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "MODE");
#define btnToggle_W           100
#define btnToggle_H            50

#define btnSpeedToggle_X       250
#define btnSpeedToggle_Y         5
#define btnInclineToggle_X     360
#define btnInclineToggle_Y       5
#define btnSpeedUp_X           250
#define btnSpeedUp_Y           100
#define btnSpeedDown_X         250
#define btnSpeedDown_Y         170
#define btnInclineUp_X         360
#define btnInclineUp_Y         100
#define btnInclineDown_X       360
#define btnInclineDown_Y       170
#elif TARGET_TTGO_T4
// no-touch screen with three buttons
#define BUTTON_1 38  // LEFT
#define BUTTON_2 37  // CENTRE
#define BUTTON_3 39  // RIGHT
#elif TARGET_WT32_WROOMD
// no display or buttons, web only
#else
#error Unknown button setup
#endif

#ifdef BUTTON_1
Button2 btn1(BUTTON_1);
#endif
#ifdef BUTTON_2
Button2 btn2(BUTTON_2);
#endif
#ifdef BUTTON_3
Button2 btn3(BUTTON_3);
#endif

#if TARGET_TTGO_T_DISPLAY
static const int SDA_0 = 21;
static const int SCL_0 = 22;
static const uint32_t I2C_FREQ = 400000;
#elif TARGET_WT32_SC01
// This is a touch screen so there is no buttons
// IO_21 and IO_22 are routed out and use used for SPI to the screen
// Pins with names that start with J seems to be connected so screen, take care to avoid.
static const int SDA_0 = 18;
static const int SCL_0 = 19;
static const uint32_t I2C_FREQ = 400000;
#elif TARGET_TTGO_T4
static const int SDA_0 = 21;
static const int SCL_0 = 22;
static const uint32_t I2C_FREQ = 400000;
#elif TARGET_WT32_WROOMD
// no display or buttons, web only
static const int SDA_0 = 18;
static const int SCL_0 = 19;
static const uint32_t I2C_FREQ = 400000;
#else
#error Unknown HW Platform
#endif

//#ifndef NO_VL53L0X
VL53L0X sensor;
const unsigned long MAX_DISTANCE = 1000;  // Maximum distance in mm
//#endif

//#ifndef NO_MPU6050
static MPU6050 mpu(I2C_0);
//#endif

//cs static GPIOExtenderAW9523 GPIOExtender(I2C_0);
GPIOExtenderAW9523 GPIOExtender(I2C_0);

void do_it(void)
 {
  btnSpeedToggle   .initButtonUL(&tft, btnSpeedToggle_X,    btnSpeedToggle_Y,   100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "SPEED");
  btnInclineToggle .initButtonUL(&tft, btnInclineToggle_X,  btnInclineToggle_Y, 100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "INCL.");
  btnSpeedUp       .initButtonUL(&tft, btnSpeedUp_X,        btnSpeedUp_Y,       100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "UP");
  btnSpeedDown     .initButtonUL(&tft, btnSpeedDown_X,      btnSpeedDown_Y,     100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "DOWN");
  btnInclineUp     .initButtonUL(&tft, btnInclineUp_X,      btnInclineUp_Y,     100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "UP");
  btnInclineDown   .initButtonUL(&tft, btnInclineDown_X,    btnInclineDown_Y,   100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "DOWN");
}

void btn1TapHandler(Button2 & b)
{
  unsigned int time = b.wasPressedFor();
  DEBUG_PRINTLN("Button 1 TapHandler");

  if (time > 3000) 
  { // > 3sec enters config menu
    DEBUG_PRINTLN("RESET timer/counter!");
    doReset();
  }
  else if (time > 600) 
  {
    DEBUG_PRINTLN("Button 1 long click...");
    // reset to manual mode
    speedInclineMode = MANUAL;
    DEBUG_PRINT("speedInclineMode=");
      DEBUG_PRINTLN(speedInclineMode);
#ifndef NO_DISPLAY
    updateHeader();
#endif      
  }
  else 
  { // button1 short click toggle speed/incline mode
    DEBUG_PRINTLN("Button 1 short click...");
    speedInclineMode += 1;
    speedInclineMode &= SPEEDINCLINE_BITFIELD; //wrap around MANUAL,SPEED,INCLINE,SPEED & INCLINE
    DEBUG_PRINT("speedInclineMode=");
    DEBUG_PRINTLN(speedInclineMode);
#ifndef NO_DISPLAY      
    updateHeader();
#endif      
  }
}

void btn2TapHandler(Button2 & b)
{
  unsigned int time = b.wasPressedFor();
    DEBUG_PRINTLN("Button 2 TapHandler");
  
  if (time > 3000) 
  { // > 3sec enters config menu
    //DEBUG_PRINTLN("very long (>3s) click ... do nothing");
  }
  else if (time > 500) 
  {
    DEBUG_PRINTLN("long (>500ms) click...");
    if ((speedInclineMode & SPEED) == 0)
	  {
      speedDown();
    }  
    if ((speedInclineMode & INCLINE) == 0)
	  {  
      inclineDown();
    }
    else 
    {
      DEBUG_PRINTLN("short click...");
      if ((speedInclineMode & SPEED) == 0)
      {
	      speedUp();
      }  
      if ((speedInclineMode & INCLINE) == 0)
	    {
        inclineUp();
      }  
    }
  }
}

