lefty01/ESP32_TTGO_FTMS/src/Hardware.cpp
void btn3TapHandler(Button2 & b)
{
  unsigned int time = b.wasPressedFor();
  DEBUG_PRINTLN("Button 3 TapHandler");
  if (time > 3000) {
    // DEBUG_PRINTLN("very long (>3s) click ... do nothing");
  }
  else 
  {
    DEBUG_PRINTLN("short click...");
    if ((speedInclineMode & SPEED) == 0)
    {
      speedDown();
    }  
    if ((speedInclineMode & INCLINE) == 0)
    {
      inclineDown();
    }  
  }
}

void loop_handle_button()
{
#ifdef BUTTON_1
  btn1.loop();
#endif
#ifdef BUTTON_2
  btn2.loop();
#endif
#ifdef BUTTON_3
    btn3.loop();
#endif
}

void initButton()
{
  logText("initButton...");  
#ifdef BUTTON_1
  // button 1 (GPIO 0) control auto/manual mode and reset timers
  btn1.setTapHandler(btn1TapHandler);
#endif

  // if only two buttons, then button 1 switches mode and button 2 short is up, button 2 long is down
  // if three buttons use button 2 short as up and button 3 short as down
  // fixme: keep button2 long handler for now does not hurt
  // initially for testing purpose ... but if we can access the controller while running it can serve as backup
  // if sensors fail or suddnely send incorrect readings (yeah that happend to me) ... but since the controller
  // might not be accessable we have the web interface that can run on the smartphone
#ifdef BUTTON_2
  // short  click = up
  // longer click = down
  btn2.setTapHandler(btn2TapHandler);
 #endif

#ifdef BUTTON_3
  // short  click = down
  btn3.setTapHandler(btn3TapHandler);
#endif

#ifdef TARGET_WT32_SC01
  // for (unsigned n = 0; n < NUM_TOUCH_BUTTONS; ++n) {
  //     touchButtons[n] = LGFX_Button();
  // }
  // fixme: ...
  logText(",inittouch...");  
  btnSpeedToggle   .initButtonUL(&tft, btnSpeedToggle_X,    btnSpeedToggle_Y,   100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "SPEED");
  btnInclineToggle .initButtonUL(&tft, btnInclineToggle_X,  btnInclineToggle_Y, 100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "INCL.");
  btnSpeedUp       .initButtonUL(&tft, btnSpeedUp_X,        btnSpeedUp_Y,       100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "UP");
  btnSpeedDown     .initButtonUL(&tft, btnSpeedDown_X,      btnSpeedDown_Y,     100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "DOWN");
  btnInclineUp     .initButtonUL(&tft, btnInclineUp_X,      btnInclineUp_Y,     100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "UP");
  btnInclineDown   .initButtonUL(&tft, btnInclineDown_X,    btnInclineDown_Y,   100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "DOWN");
  //modeButton.initButtonUL(&tft, 260, 5, 100, 50, TFT_WHITE, TFT_BLUE, TFT_WHITE, "MODE");
  //modeButton.drawButton();
#endif
  logText("done\n");  
}

void delayWithDisplayUpdate(unsigned long delayMilli)
{
  unsigned long timeStartMilli = millis();
  unsigned long currentMilli = timeStartMilli;
  while((currentMilli - timeStartMilli) < delayMilli)
  {
#warning todo cs: add gxloop handler again.
//    gfxUpdateLoopHandler();
    unsigned long timeLeftMilli = delayMilli - (currentMilli - timeStartMilli) ; 
    if (timeLeftMilli >= 5 )
    {
      delay(5);
    }
    else
    {
      delay(timeLeftMilli);
    }
    currentMilli = millis();
  }
}

void initSensors(void)
{
  if (configTreadmill.hasMPU6050)
  {
    logText("init MPU6050....");

    byte status = mpu.begin();
    DEBUG_PRINT("status: ");
    DEBUG_PRINT(status);

    if (status != 0) 
    {
      logText(" failed\n");
    }
    else
    {
      logText("Calc offsets, do not move MPU6050 (3sec)");

      mpu.calcOffsets(); // gyro and accel.
      delayWithDisplayUpdate(2000);
      speedInclineMode |= INCLINE;

      logText(" done\n");
    }
  }

  if (configTreadmill.hasVL53L0X) 
  {
    logText("init VL53L0X\n");
    sensor.setTimeout(500);

    if (!sensor.init()) 
    {
      DEBUG_PRINTLN("Failed to detect and initialize VL53L0X sensor!");
      logText("VL53L0X setup failed!\n");    
    }
    else 
    {
      DEBUG_PRINTLN("VL53L0X sensor detected and initialized!");
      logText("VL53L0X initialized!\n");
    }
  }
}

void IRAM_ATTR reedSwitch_ISR()
{
  // calculate the microseconds since the last interrupt.
  // Interupt activates on falling edge.
  uint32_t usNow = micros();
  uint32_t test_elapsed = usNow - startTime;

  // handle button bounce (ignore if less than 300 microseconds since last interupt)
  if (test_elapsed < 300) {
    return;
  }

  //if (test_elapsed > 1000000) {
  if (test_elapsed > 1000000) {  // assume the treadmill isn't spinning in 1 second.
    startTime = usNow; // reset the clock;
    longpauseTime = 0;
    return;
  }
  if (test_elapsed > longpauseTime / 2) {
    // acts as a debounce, don't looking for interupts soon after the first hit.
    //DEBUG_PRINT(test_elapsed); //DEBUG_PRINTLN(" Counted");

    startTime = usNow;  // reset the clock
    //long elapsed = test_elapsed;
    longpauseTime = test_elapsed;

    revCount++;
    workoutDistance += configTreadmill.belt_distance;
    accumulatorInterval += test_elapsed;
  }
}

// two IR-Sensors
void IRAM_ATTR speedSensor1_ISR(void)
{
  if (! t1_valid) {
    t1 = micros();
    t1_valid = true;
  }
}

void IRAM_ATTR speedSensor2_ISR(void)
{
  if (t1_valid && !t2_valid) {
    t2 = micros();
    t2_valid = true;
  }
}

// getIncline()
// This will read the used "incline" sensor, run this periodically
// The following global variables will be updated
//    angle - the angle of the running are
//    incline - the incline value (% of angle between 0 and 45 degree)
//              incline is usally the value shown by your treadmill.
float getIncline(void) 
{
  double sensorAngle = 0.0;
  float temp_incline;
  char yStr[5];
  char inclineStr[6];

  if (configTreadmill.hasVL53L0X) 
  {
    // calc incline/angle from distance
    // depends on sensor placement ... TODO: configure via webinterface
  }

  if (configTreadmill.hasMPU6050) 
  {
    // MPU6050 returns a incline/grade in degrees(!)
    // TODO: configure sensor orientation  via webinterface
    // FIXME: maybe get some rolling-average of Y-angle to smooth things a bit (same for speed)
    // mpu.getAngle[XYZ]
    sensorAngle = mpu.getAngleY();
    angle = angleSensorTreadmillConversion(sensorAngle);

    if (angle < 0) angle = 0;  // TODO We might allow running downhill

    snprintf(yStr, 5, "%.2f", angle);

    temp_incline = tan(angle * DEG_TO_RAD) * 100;
    snprintf(inclineStr, 6, "%.1f", temp_incline);

    //client.publish(getTopic(MQTT_TOPIC_Y_ANGLE), yStr);
#warning check out if this must be here ******************
    // CS WHY IS THIS HERE
    //client.publish(getTopic(MQTT_TOPIC_INCLINE), inclineStr);
    // ******************************************
  }

  if (temp_incline <= configTreadmill.min_incline) temp_incline = configTreadmill.min_incline;
  if (temp_incline > configTreadmill.max_incline)  temp_incline = configTreadmill.max_incline;

#warning cs todo remove this
  DEBUG_PRINTF("sensor angle (%.2f): used angle: %.2f: -> incline: %f%%\n",sensorAngle, angle, temp_incline);

  // probably need some more smoothing here ...
  // ...
  return temp_incline;
}

void loop_handle_hardware(void)
{
  unsigned long t;
#warning remove this contsant to some file  
  const unsigned long c = 359712; // d=10cm

